//  🪙
//  🪙 🪙&nbsp;
//  🪙 🪙 🪙&nbsp;
//  🪙 🪙 🪙 🪙
//  🪙 🪙 🪙 🪙 🪙
//  🪙 🪙 🪙 🪙 🪙 🪙
//  🪙 🪙 🪙 🪙 🪙 🪙 🪙&nbsp;

//   Играют два игрока.
//   За один ход можно убрать любое количество монеток из любого ряда.
//   Побеждает тот, кто берет последнюю монетку.


//   Сколько нужно взять монет и из какого ряда на первом шаге, чтобы победить?
//              =
//   На первом ходу первый игрок должен взять 1 монетку из ряда, где их 7, оставив в этом ряду 6 монет, чтобы создать выигрышную ситуацию.